{
    "user_status": {
        "isGoingThroughStep": true,
        "for_desc_tag": "requesting emergency maintenance",
        "waiting_for_input": "id_subscribe_product",
        "process": "request_maintenance"
    },
    "chat_history": [
        {
            "context": "list product",
            "desc_tag": "show product",
            "user_input": [],
            "result": [
                {
                    "number": 1,
                    "id_product": 1,
                    "id_brand": 1,
                    "name_product": "Infrastructure as a Services",
                    "desc_product": "IaaS allows consumer to adjust processing capacity by scaling the infrastructure resources vertically and horizontally in an automated manner according to the change of processing demand."
                },
                {
                    "number": 2,
                    "id_product": 2,
                    "id_brand": 1,
                    "name_product": "Database as a Service",
                    "desc_product": "Automatically and continuously manage and monitor your database health and resources securely. Whenever issues are detected on your database, Alibaba Cloud will allocate and simplify it."
                },
                {
                    "number": 3,
                    "id_product": 3,
                    "id_brand": 1,
                    "name_product": "Apsara Stack",
                    "desc_product": "Apsara Stack is a full-stack cloud solution created by Alibaba Cloud for medium- and large-size enterprise-class customers. Apsara Stack employs a distributed architecture based on Alibaba Cloud to create an open, unified, and reliable cloud environment for enterprise-class customers."
                },
                {
                    "number": 4,
                    "id_product": 4,
                    "id_brand": 2,
                    "name_product": "Backup and Recovery",
                    "desc_product": "Together with Alibaba Cloud, XtreAM Cloud provides cloud services in private or public. Using our cloud services, you can plan on-site or off-sitebackups and recovery, storage and retrieval of data, and allow strict security during hours of access to information needed."
                },
                {
                    "number": 5,
                    "id_product": 5,
                    "id_brand": 2,
                    "name_product": "Cloud Disaster Recovery",
                    "desc_product": "Business demands 24x7 service levels for application availability. It requires the effectiveness of disaster recovery solution to support business continuity plan. Cloud XtreAM and with the technology from Alibaba Cloud provides DR solutions that are suitably fast, flexible, adaptable, and automated based on cloud. Our solutions provide to meet your RTO and PRO business requirement."
                },
                {
                    "number": 6,
                    "id_product": 6,
                    "id_brand": 2,
                    "name_product": "Infrastructure as a Services",
                    "desc_product": "The Cloud is not a commodity, and virtual servers are not the same wherever you go. You expect any virtual cloud server to have the speed required for deployment, flexible scalability, and pay-as-you-go billing. Cloud XtreAm with Alibaba Cloud technology delivers the solution of virtual servers exceed those expectations. Our virtual server deliver a higher degree of customization, transparancy, and it aslo integrate seamlessly with metal bare servers."
                },
                {
                    "number": 7,
                    "id_product": 7,
                    "id_brand": 3,
                    "name_product": "ISLA",
                    "desc_product": "Isla neutralizes the critical categories of web, email and document-based threats by taking all incoming code and isolating it on a remote virtual browser, then streaming harmless pixels back to your endpoint."
                },
                {
                    "number": 8,
                    "id_product": 8,
                    "id_brand": 4,
                    "name_product": "Open Networking Solution",
                    "desc_product": "Edgecore\u0092s Open Networking Solution help reducing network & operating expenses, while automate & accelerate provisioning of network capacity and services. Come with a choice of independent open software for NOS (Network Operating Systems), SDN, virtualization, and cloud orchestration, these open networking available in various network deployment from 1G, 10G, 25G, 40G to 100G."
                },
                {
                    "number": 9,
                    "id_product": 9,
                    "id_brand": 4,
                    "name_product": "Enterprise Switch",
                    "desc_product": "Edgecore Networks provides a full range of managed and unmanaged switch to fulfill different deployment requirements, from small/medium business users, enterprises to carrier-level service providers."
                },
                {
                    "number": 10,
                    "id_product": 10,
                    "id_brand": 5,
                    "name_product": "ArcGis Enterprise",
                    "desc_product": "ArcGIS offers a unique set of capabilities to apply location-based analysis to your business practices. Gain broader insights using contextual tools to visualize and analyze your data. Collaborate with others and share your insights through maps, applications and reports."
                },
                {
                    "number": 11,
                    "id_product": 11,
                    "id_brand": 6,
                    "name_product": "Smart OmniEgde Solution",
                    "desc_product": "Smart OmniEdge network solution provides a unified wired/wireless infrastructure for cloud or premise deployment, augmented with AI-powered applications and managed through a single pane of glass."
                },
                {
                    "number": 12,
                    "id_product": 12,
                    "id_brand": 6,
                    "name_product": "Automated Campus Networking Solutions",
                    "desc_product": "Quickly deploy the new digital technology that your organization requires, prevent cyber-attacks at every entry point, and do it all while delivering a consistent and personalized user experience."
                },
                {
                    "number": 13,
                    "id_product": 13,
                    "id_brand": 6,
                    "name_product": "Agile Data Center Networking Solution",
                    "desc_product": "Extreme Networks Agile Data Center solutions deliver the automation, visibility, and flexibility needed to make digital transformation a reality."
                },
                {
                    "number": 14,
                    "id_product": 14,
                    "id_brand": 7,
                    "name_product": "Optical Receiver",
                    "desc_product": "Fully compliant with Ethernet, Fibre Channel, Infiniband, SONET/SDH/OTN, CPRI and PON standards and operate at data rates in excess of 100 Gb/s."
                },
                {
                    "number": 15,
                    "id_product": 15,
                    "id_brand": 8,
                    "name_product": "Nucleus",
                    "desc_product": "The 3D unified management system that interposes the real-time data avalanche of sensor networks with 3D building information to provide comprehensive situation awareness to premise managers."
                },
                {
                    "number": 16,
                    "id_product": 16,
                    "id_brand": 9,
                    "name_product": "Defending the Network Perimeter",
                    "desc_product": "Network perimeter is the first line of the security defense for enterprise, Hillstone provides the next generation perimeter solutions with the unparalleled threat visibility and protection without compromising the network performance and business continuity, these include Next-Generation Firewall (NGFW) and Network Intrusion Prevention System (NIPS)."
                },
                {
                    "number": 17,
                    "id_product": 17,
                    "id_brand": 10,
                    "name_product": "IBM Software",
                    "desc_product": "IBM Software systems and applications are designed to solve the most challenging needs of organizations large and small, across all industries, worldwide."
                },
                {
                    "number": 18,
                    "id_product": 18,
                    "id_brand": 10,
                    "name_product": "IBM Hardware",
                    "desc_product": "IBM Hardware goes beyond standard infrastructure to help you put smart to work. Ensure your hardware meets today's expectations & prepares your business for the future."
                },
                {
                    "number": 19,
                    "id_product": 19,
                    "id_brand": 10,
                    "name_product": "IBM Cloud",
                    "desc_product": "IBM Cloud is a platform that helps developers build and run modern apps and services. It provides developers with instant access to the compute and services they need to launch quickly, iterate continuously and scale with success."
                },
                {
                    "number": 20,
                    "id_product": 20,
                    "id_brand": 10,
                    "name_product": "IBM FlashSystem 9100",
                    "desc_product": "IBM FlashSystem 9100 combines the performance of flash and Non-Volatile Memory Express (NVMe) end-to-end with the reliability and innovation of IBM FlashCore technology, the rich features of IBM Spectrum Virtualize\u0099 and AI predictive storage management and proactive support by Storage Insights\u0099\u0097 all in a powerful 2U enterprise-class, blazing fast storage all-flash array. Providing intensive data driven multicloud storage capacity, FlashSystem 9100 allows you to easily add in the multicloud solut"
                },
                {
                    "number": 21,
                    "id_product": 21,
                    "id_brand": 11,
                    "name_product": "Wireless Backhaul and Last Mile Connectivity",
                    "desc_product": "Wireless Backhaul and Last Mile Connectivity\r\nIgniteNet MetroLinq products utilize the 60 GHz millimeter wave band to enable the delivery of multi-gigabit connectivity wirelessly allowing quick roll-out of fiber like wireless networks across the globe."
                },
                {
                    "number": 22,
                    "id_product": 22,
                    "id_brand": 12,
                    "name_product": "Application Security",
                    "desc_product": "protects your applications wherever they are located and tirelessly defends your business growth with full-function cloud application security and delivery with on-premises security options."
                },
                {
                    "number": 23,
                    "id_product": 23,
                    "id_brand": 12,
                    "name_product": "Data Security",
                    "desc_product": "Securing your data from attacks and simplifying regulatory compliance is crucial for online business. Imperva Data Security does both. Imperva data security protects your data on-premises and in the cloud by monitoring all data activity from unauthorized access."
                },
                {
                    "number": 24,
                    "id_product": 24,
                    "id_brand": 13,
                    "name_product": "Server",
                    "desc_product": "Drive your business forward with a technology that matches your needs. Reduce costs and complexity by investing in a system that handles today's workload and expands to accommodate future growth."
                },
                {
                    "number": 25,
                    "id_product": 25,
                    "id_brand": 13,
                    "name_product": "Storage",
                    "desc_product": "Lenovo enterprise-grade storage products can adapt to your growing virtual environments, fit into your existing budget, and ensure data is ready when you need it."
                },
                {
                    "number": 26,
                    "id_product": 26,
                    "id_brand": 14,
                    "name_product": "Decision Focused",
                    "desc_product": "While many organizations build powerful analytic models, only half of them, on average ever make it into production.? That's a lot of waste. SAS Viya simplifies model deployment \u0096 helping you cross that critical \"last mile\" \u0096 and enables you to centrally monitor and manage the performance of all your analytic models."
                },
                {
                    "number": 27,
                    "id_product": 27,
                    "id_brand": 14,
                    "name_product": "Developer Friendly",
                    "desc_product": "SAS Viya is developer friendly because it can be embedded into your applications and can be called only when needed, saving you time, resources, and reducing the need to trade speed for operational excellence."
                },
                {
                    "number": 28,
                    "id_product": 28,
                    "id_brand": 14,
                    "name_product": "Automated",
                    "desc_product": "Data preparation and manual coding takes a tremendous amount of time and skilled resources.  This time is better spent innovating and operationalizing insights.  SAS Viya provides a number of key automation capabilities including:"
                },
                {
                    "number": 29,
                    "id_product": 29,
                    "id_brand": 14,
                    "name_product": "Governed",
                    "desc_product": "As AI and machine learning become more widespread, organizations struggle to explain decisions, and foster ethical AI adoption.  SAS has built-in"
                },
                {
                    "number": 30,
                    "id_product": 30,
                    "id_brand": 14,
                    "name_product": "Continously Updated",
                    "desc_product": "SAS Viya is continuously updated with quick, incremental product enhancements that you control.  So your data scientists, business analysts, and application developers can take advantage of our latest innovations, the moment they\u0092re ready."
                },
                {
                    "number": 31,
                    "id_product": 31,
                    "id_brand": 14,
                    "name_product": "Cloud Native",
                    "desc_product": "Cloud technologies are evolving. While SAS has always run in the cloud, SAS Viya is on the forefront of cloud evolution with a completely redesigned architecture that is compact, cloud native and fast. Whether you prefer software as a service (SaaS) from the SAS Cloud or choose a public or private cloud provider, you'll be able to make the most of your cloud investment."
                },
                {
                    "number": 32,
                    "id_product": 32,
                    "id_brand": 15,
                    "name_product": "Loss Prevention",
                    "desc_product": "Sensormatic empowers retailers to fight global shrink and retail crime with proven merchandise protection solutions"
                },
                {
                    "number": 33,
                    "id_product": 33,
                    "id_brand": 15,
                    "name_product": "Traffic Insight",
                    "desc_product": "ShopperTrak Analytics delivers data that retailers can easily convert into meaningful insights and actionable outcomes, while shopper experiences with the retail landscape are evolving rapidly."
                },
                {
                    "number": 34,
                    "id_product": 34,
                    "id_brand": 15,
                    "name_product": "Analytics",
                    "desc_product": "Analytics Solutions is designed to provide insights from shopper traffic to inventory management that deliver positive retail outcomes and reshape retailers' operations."
                },
                {
                    "number": 35,
                    "id_product": 35,
                    "id_brand": 15,
                    "name_product": "Inventory Intelligence",
                    "desc_product": "TrueVUE\u0092s Inventory Intelligence harnesses the power of data and gives you a single view of item-level inventory across the enterprise to improve your sales."
                },
                {
                    "number": 36,
                    "id_product": 36,
                    "id_brand": 16,
                    "name_product": "Data Security Platform",
                    "desc_product": "Detects insider threats and cyberattacks by analyzing data, account activity, and user behavior; prevents and limits disaster by locking down sensitive and stale data; and efficiently sustains a secure state with automation."
                },
                {
                    "number": 37,
                    "id_product": 37,
                    "id_brand": 16,
                    "name_product": "DatAdvantage",
                    "desc_product": "DatAdvantage maps who can access data and who does access data \u0096 across file and email systems, shows where users have too much access, and then safely automates changes to access control lists and security groups."
                },
                {
                    "number": 38,
                    "id_product": 38,
                    "id_brand": 16,
                    "name_product": "Data Classification Engine",
                    "desc_product": "Varonis automatically scans and classifies sensitive, regulated information stored in file shares, NAS devices, SharePoint, and Office 365."
                },
                {
                    "number": 39,
                    "id_product": 39,
                    "id_brand": 16,
                    "name_product": "DatAlert",
                    "desc_product": "Detect unusual file and email activity across cloud and on-premises data stores, suspicious account and computer behavior in Active Directory, and other indicators of compromise to protect your data before it\u0092s too late."
                }
            ]
        },
        {
            "context": "",
            "desc_tag": "register account",
            "user_input": [
                {
                    "response": "please input your full name ...",
                    "desc": "name_user",
                    "value": null,
                    "input_validation": "name",
                    "helper_information": []
                },
                {
                    "response": "please input your email ...",
                    "desc": "email_user",
                    "value": null,
                    "input_validation": "email",
                    "helper_information": ""
                },
                {
                    "response": "please input your phone_number ...",
                    "desc": "phone_number",
                    "value": null,
                    "input_validation": "phone number",
                    "helper_information": ""
                },
                {
                    "response": "please input your address ...",
                    "desc": "address_user",
                    "value": null,
                    "input_validation": "",
                    "helper_information": ""
                },
                {
                    "response": "please input your company id ...",
                    "desc": "id_company",
                    "value": null,
                    "input_validation": "company",
                    "helper_information": ""
                }
            ],
            "result": null
        },
        {
            "context": "",
            "desc_tag": "register account",
            "user_input": [
                {
                    "response": "please input your full name ...",
                    "desc": "name_user",
                    "value": "rievaldy",
                    "input_validation": "name",
                    "helper_information": []
                },
                {
                    "response": "please input your email ...",
                    "desc": "email_user",
                    "value": "rievaldy3235@gmail.com",
                    "input_validation": "email",
                    "helper_information": ""
                },
                {
                    "response": "please input your phone_number ...",
                    "desc": "phone_number",
                    "value": "0895330343387",
                    "input_validation": "phone number",
                    "helper_information": ""
                },
                {
                    "response": "please input your address ...",
                    "desc": "address_user",
                    "value": "jl.h.jali",
                    "input_validation": "",
                    "helper_information": ""
                },
                {
                    "response": "please input your company id ...",
                    "desc": "id_company",
                    "value": "1111",
                    "input_validation": "company",
                    "helper_information": ""
                }
            ],
            "result": {
                "id_user": 1826457406,
                "name_user": "rievaldy",
                "email_user": "rievaldy3235@gmail.com",
                "phone_number": "0895330343387",
                "address_user": "jl.h.jali",
                "id_company": "1111"
            }
        },
        {
            "context": "maintenance",
            "desc_tag": "requesting emergency maintenance",
            "user_input": [
                {
                    "response": "please input your id product ...",
                    "desc": "id_subscribe_product",
                    "value": null,
                    "input_validation": "available number option",
                    "helper_information": []
                },
                {
                    "response": "please describe the issues ...",
                    "desc": "desc_maintenance",
                    "value": null,
                    "input_validation": "",
                    "helper_information": ""
                },
                {
                    "response": "from scale 1 to 3, how much impact does the problem have on your company ?...",
                    "desc": "severity_level",
                    "value": null,
                    "input_validation": "severity level",
                    "helper_information": ""
                }
            ],
            "result": null
        },
        {
            "context": "maintenance",
            "desc_tag": "requesting emergency maintenance",
            "user_input": [
                {
                    "response": "please input your id product ...",
                    "desc": "id_subscribe_product",
                    "value": null,
                    "input_validation": "available number option",
                    "helper_information": []
                },
                {
                    "response": "please describe the issues ...",
                    "desc": "desc_maintenance",
                    "value": null,
                    "input_validation": "",
                    "helper_information": ""
                },
                {
                    "response": "from scale 1 to 3, how much impact does the problem have on your company ?...",
                    "desc": "severity_level",
                    "value": null,
                    "input_validation": "severity level",
                    "helper_information": ""
                }
            ],
            "result": null
        }
    ]
}